from pprint import pprint 


question_num_detail_dict = {
    1: '話し好き', 2: '無口な', 3: '陽気な', 4: '外交的', 5: '暗い', 6: '無愛想な', 7: '社交的', 8: '人嫌い', 9: '活動的な', 10: '意思表示しない', 11: '積極的な', 12: '地味な', # 外向性
    13: '悩みがち', 14: '不安になりやすい', 15: '心配性', 16: '気苦労の多い', 17: '弱気になる', 18: '傷つきやすい', 19: '動揺しやすい', 20: '神経質な', 21: 'くよくよしない', 22: '悲観的な', 23: '緊張しやすい', 24: '憂鬱な', # 神経症傾向
    25: '独創的な', 26: '多才の', 27: '進歩的', 28: '洞察力のある', 29: '想像力に富んだ', 30: '美的感覚の鋭い', 31: '頭の回転の速い', 32: '臨機応変な', 33: '興味の広い', 34: '好奇心が強い', 35: '独立した', 36: '呑み込みの速い', # 開放性
    37: 'いい加減な', 38: 'ルーズな', 39: '怠惰な', 40: '成り行きまかせ', 41: '不精な', 42: '計画性のある', 43: '無頓着な', 44: '軽率な', 45: '勤勉な', 46: '無節操', 47: '几帳面な', 48: '飽きっぽい', # 誠実性
    49: '温和な', 50: '短期', 51: '怒りっぽい', 52: '寛大な', 53: '親切な', 54: '良心的な', 55: '協力的な', 56: 'とげがある', 57: 'かんしゃくもち', 58: '自己中心的', 59: '素直な', 60: '反抗的' # 協調性
}
# このリストは質問事項をランダムに並び替えるためのリストです(リストの数字は上の辞書のキーに対応している)
random_list = [38, 51, 47, 31, 48, 13, 7, 56, 36, 33, 9, 41, 59, 60, 19, 46, 26, 11, 58, 42, 39, 16, 6, 24, 22, 29, 53, 4, 28, 52, 21, 43, 18, 40, 35, 50, 5, 1, 10, 3, 45, 8, 32, 37, 25, 57, 23, 27, 15, 49, 12, 20, 34, 55, 54, 30, 17, 2, 14, 44]

# 反転項目のリスト(リストの数字は上の辞書のキーに対応している)
reverse_items = [2, 5, 6, 8, 19, 12, 21, 42, 45, 47, 50, 51, 56, 57, 58, 60]

'''
random_listの順番に従って質問事項をランダムに並び替える。(a)などとアルファベットを付けいてる理由は回答の数字と混濁するのを防ぐため
返り値:
    [
        "(a) ...",
        "(b) ...",
        :
        :
        "(bh) ..."
    ]
'''
def get_question_items_list():
    question_items_list = []
    for i, random_index in enumerate(random_list):
        if i <= 25:
            alphabet = chr(97+i)
        elif i <= 51:
            alphabet = f"a{chr(97+i-26)}"
        else:
            alphabet = f"b{chr(97+i-52)}"
        question_items_list.append(f"({alphabet}) {question_num_detail_dict[random_index]}")
    return question_items_list

questions = '\n'.join(get_question_items_list())

BFI_test_prompt = f'''いまからあなたに性格に関する質問をします。以下の質問に対して、それぞれどのくらい当てはまるかを次のように評価してください。回答は問題番号の横に数値のみ記入してください。また、回答は質問ごとに開業して出力してください。
また、出力は「回答:」以降のものにしてください。

1: まったくあてはまらない
2: ほとんどあてはまらない
3: あまりあてはまらない
4: どちらとも言えない
5: ややあてはまる
6: かなりあてはまる
7: 非常にあてはまる

質問:
{questions}
回答:
(a) 5
(b) 3
(c) 7
(d) 5
(e) 7
(f) 4
(g) 3
(h) 6
(i) 5
(j) 4
(k) 6
(l) 3
(m) 1
(n) 2
(o) 5
(p) 2
(q) 4
(r) 3
(s) 3
(t) 7
(u) 2
(v) 6
(w) 7
(x) 5
(y) 6
(z) 7
(aa) 4
(ab) 4
(ac) 7
(ad) 3
(ae) 5
(af) 3
(ag) 3
(ah) 6
(ai) 4
(aj) 6
(ak) 6
(al) 6
(am) 2
(an) 2
(ao) 3
(ap) 1
(aq) 4
(ar) 4
(as) 2
(at) 6
(au) 3
(av) 2
(aw) 6
(ax) 6
(ay) 5
(az) 1
(ba) 6
(bb) 1
(bc) 6
(bd) 6
(be) 4
(bf) 1
(bg) 2
(bh) 6

質問:
{questions}
回答:
(a) 4
(b) 4
(c) 5
(d) 4
(e) 4
(f) 3
(g) 6
(h) 7
(i) 7
(j) 3
(k) 5
(l) 7
(m) 3
(n) 1
(o) 7
(p) 1
(q) 7
(r) 5
(s) 3
(t) 5
(u) 2
(v) 2
(w) 1
(x) 6
(y) 1
(z) 5
(aa) 3
(ab) 5
(ac) 2
(ad) 6
(ae) 2
(af) 2
(ag) 2
(ah) 3
(ai) 1
(aj) 1
(ak) 2
(al) 7
(am) 6
(an) 5
(ao) 6
(ap) 2
(aq) 1
(ar) 6
(as) 6
(at) 1
(au) 3
(av) 5
(aw) 1
(ax) 3
(ay) 4
(az) 6
(ba) 1
(bb) 3
(bc) 7
(bd) 1
(be) 1
(bf) 4
(bg) 1
(bh) 3

質問:
{questions}
回答:
(a) 1
(b) 2
(c) 2
(d) 7
(e) 1
(f) 1
(g) 5
(h) 3
(i) 3
(j) 3
(k) 5
(l) 4
(m) 3
(n) 2
(o) 6
(p) 2
(q) 1
(r) 1
(s) 6
(t) 1
(u) 5
(v) 2
(w) 1
(x) 7
(y) 2
(z) 3
(aa) 3
(ab) 2
(ac) 7
(ad) 6
(ae) 6
(af) 7
(ag) 6
(ah) 6
(ai) 7
(aj) 6
(ak) 6
(al) 5
(am) 4
(an) 7
(ao) 5
(ap) 1
(aq) 2
(ar) 2
(as) 7
(at) 7
(au) 4
(av) 5
(aw) 1
(ax) 1
(ay) 7
(az) 4
(ba) 2
(bb) 4
(bc) 1
(bd) 6
(be) 6
(bf) 1
(bg) 6
(bh) 4

質問:
{questions}
回答:
(a) 7
(b) 4
(c) 3
(d) 6
(e) 5
(f) 4
(g) 3
(h) 6
(i) 6
(j) 7
(k) 7
(l) 2
(m) 1
(n) 6
(o) 2
(p) 5
(q) 1
(r) 3
(s) 6
(t) 5
(u) 7
(v) 1
(w) 2
(x) 5
(y) 2
(z) 2
(aa) 6
(ab) 7
(ac) 7
(ad) 1
(ae) 1
(af) 5
(ag) 3
(ah) 5
(ai) 5
(aj) 5
(ak) 1
(al) 6
(am) 2
(an) 7
(ao) 6
(ap) 4
(aq) 6
(ar) 2
(as) 4
(at) 1
(au) 4
(av) 6
(aw) 7
(ax) 4
(ay) 1
(az) 6
(ba) 5
(bb) 3
(bc) 4
(bd) 2
(be) 1
(bf) 3
(bg) 4
(bh) 3

質問:
{questions}
回答:'''

if __name__ == '__main__':
    print(BFI_test_prompt)